/*Вариант 10

*Задание 1. Унарная операция
Создать объект "Дэк".Размер и значения дэка вводятся с клавиатуры пользователем. Необходимо перегрузить
следующие операторы:
-оператор ! как метод для получения дэка с отрицательными значениями;
-оператор префиксного декрементирования как метод для уменьшения значения всех элементов дэка на единицу;
-оператор префиксного инкрементирования как метод для увеличения всех элементов на 0,5;
-оператор постфиксного декрементирования как дружественную функцию для извлечения из дэка;
-оператор постфиксного инкрементирования как дружественная функция для добавления элемента(пользовательское число) в дэк.

* Задание 2. Бинарная операция
Создать класс "Целое число".Необходимо перегрузить следующие операторы:
-оператор сложения,
-оператор вычитания,
-оператор умножения,
-оператор деления
как для работы с другими экземплярами класса, так и с пользовательскими числами;
-оператор преобразования в int.
Необходимо учитывать то, что пользовательское число и объект класса могут находится и слева и справа от оператора.
На усмотрение студента остается решение какой оператор какой перегрузки требует(метод или дружественная функция)*/
#include "Deque.h"

int main() {
    Deque<double> d;
    return 0;
}


